cf_billing/Documents/энргОбходнойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргОбходнойЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныйОбъемПриборов</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеДляТУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовУчетаАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Техническая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргОбходнойЛист/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаполнитьСписокВозможныхОперацийФормаСписка() Экспорт 
	СписокОпераций = Новый СписокЗначений;
	ДополнитьСписокВыбораДоступнымиВидамиОпераций(СписокОпераций);

	Возврат СписокОпераций;
КонецФункции 

Функция СоотвествиеВидовОперацииИПрефиксовФорм() Экспорт	
	Соотвествие = Новый Соответствие;
	ДополнитьСоотвествиеВидовОперацииИПрефиксовФорм(Соотвествие);
	
	Возврат Соотвествие;	
КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Основание				= Неопределено;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОбходнойЛист",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОбходнойЛист",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОбходнойЛист",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОбходнойЛист");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса  	= Новый Структура;
	Схема 				= Неопределено;
	
	ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема,Регистры);
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПричиныОтклоненияИсключая 		= Новый Массив;//энргРаботаСПоказаниямиПриборовУчетаСервер.ПричиныОтклоненияИсключая();
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы"					, ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПричиныОтклоненияИсключая"	, ПричиныОтклоненияИсключая);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений"		, энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений"	, КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьСхемуЗапросаДействующихПриборовУчетаПомещения_безКлючаПомещения(Схема, Параметры) Экспорт 
	
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема,Параметры,"ВведенныеПриборыДействующихТочек");
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема,Параметры,"УслугиДействующихТочек");
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема,Параметры,"НаправлениеИспользованияДействующихТочек");
	РегистрыСведений.энргВидыДифференцированностиПриборовУчета.ВидДифференцированностиВведенныхПриборов(Схема,Параметры,"ВидДифференцированностиВведенныхПриборов");
	РегистрыСведений.энргРасчетныеСпособыТочекУчета.ДействующиеТочкиТочкиПоФормуле(Схема,Параметры,"ДействующиеТочкиТочкиПоФормуле");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВведенныеПриборыДействующихТочек.Организация КАК Организация,
	|		ВведенныеПриборыДействующихТочек.Район КАК Район,
	|		ВведенныеПриборыДействующихТочек.КлючПомещения КАК КлючПомещения,
	|		ВведенныеПриборыДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|		ВведенныеПриборыДействующихТочек.ПриборУчета КАК ПриборУчета,
	|		энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем
	|	ИЗ
	|		ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО ВведенныеПриборыДействующихТочек.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ИЗ
	|	(ВЫБРАТЬ
	|		Вложенныйзапрос.Организация КАК Организация,
	|		Вложенныйзапрос.Район КАК Район,
	|		Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
	|		Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|		Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|		Вложенныйзапрос.Шкала КАК Шкала,
	|		Вложенныйзапрос.Услуга КАК Услуга,
	|		Вложенныйзапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|		Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		Вложенныйзапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		Вложенныйзапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|		ЕСТЬNULL(энргВидыУслуг.СоставнаяУслуга, ЛОЖЬ) КАК СоставнаяУслуга
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДанныеПоПриборам.Организация КАК Организация,
	|			ДанныеПоПриборам.Район КАК Район,
	|			ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
	|			ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|			ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|			ДанныеПоПриборам.Шкала КАК Шкала,
	|			ДанныеПоПриборам.РегистрируетОбъем КАК РегистрируетОбъем,
	|			ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|			ЕСТЬNULL(НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ,
	|			НЕ ДействующиеТочкиТочкиПоФормуле.ТочкаУчета ЕСТЬ NULL КАК РасчетПоФормуле,
	|			ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности
	|		ИЗ
	|			ДанныеПоПриборам КАК ДанныеПоПриборам
	|				ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = УслугиДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = УслугиДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = УслугиДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = НаправлениеИспользованияДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = НаправлениеИспользованияДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеТочкиТочкиПоФормуле КАК ДействующиеТочкиТочкиПоФормуле
	|				ПО ДанныеПоПриборам.Организация = ДействующиеТочкиТочкиПоФормуле.Организация
	|					И ДанныеПоПриборам.Район = ДействующиеТочкиТочкиПоФормуле.Район
	|					И ДанныеПоПриборам.КлючПомещения = ДействующиеТочкиТочкиПоФормуле.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = ДействующиеТочкиТочкиПоФормуле.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
	|				ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
	|					И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
	|					И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
	|					И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
	|					И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО Вложенныйзапрос.Услуга = энргВидыУслуг.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО ВложенныйЗапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала");
	
КонецПроцедуры

Функция ДействующиеТочкиИИхПриборы_БезКлючаПомещения(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт 
	
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));

	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета"	, "ТочкаУчета")		, Неопределено));
	КонецЕсли;
	
	Если НЕ КлючПомещения = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")		, Неопределено));
	КонецЕсли;
	
	Если НЕ Район = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"	, "Район")		, Неопределено));
	КонецЕсли;


	Если ПараметрыОтбора = Неопределено Тогда
		Параметры 		= Новый Структура;	
	Иначе
		Параметры		= ПараметрыОтбора;
	КонецЕсли;
	
	Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		 Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	энргСостояниеТочекУчета.ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры);
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПоПриборамИтог.Организация КАК Организация,
		|	ДанныеПоПриборамИтог.Район КАК Район,
		|	ДанныеПоПриборамИтог.КлючПомещения КАК КлючПомещения,
		|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
		|	ДанныеПоПриборамИтог.РодительТочкиУчета КАК РодительТочкиУчета,
		|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
		|	ДанныеПоПриборамИтог.Услуга КАК Услуга,
		|	ДанныеПоПриборамИтог.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ДанныеПоПриборамИтог.ВидДифференцированности КАК ВидДифференцированности,
		|	ДанныеПоПриборамИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеПоПриборамИтог.РасчетПоФормуле КАК РасчетПоФормуле,
		|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеПоПриборамИтог.Поставщик КАК Поставщик,
		|	ДанныеПоПриборамИтог.НомерПломбы КАК НомерПломбы,
		|	ДанныеПоПриборамИтог.ДатаПоверки КАК ДатаПоверки,
		|	ДанныеПоПриборамИтог.СоставнаяУслуга КАК СоставнаяУслуга
		|ИЗ
		|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Район,
		|	КлючПомещения,
		|	РодительТочкиУчета,
		|	ТочкаУчета,
		|	Шкала"); 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);	
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",		Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",		ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",	ТочкаУчета);
	КонецЕсли;
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
			
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСписокВыбораДоступнымиВидамиОпераций(СписокОпераций)
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОбходнойЛист_МассовыйВвод			 , "Массовый ввод");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОбходнойЛист_РегистрацияПоСтроению , "Регистрация по строению");		
КонецПроцедуры

Процедура ДополнитьСоотвествиеВидовОперацииИПрефиксовФорм(Соотвествие)
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОбходнойЛист_МассовыйВвод			, "МассовыйВвод");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОбходнойЛист_РегистрацияПоСтроению	, "РегистрацияПоСтроению");	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры)
	
	ИмяРегистра 	= "энргПоказанияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	0 КАК Разделитель,
	|	ВЫБОР
	|		КОГДА энргПриборыУчетаАбонента.РегистрируетОбъем
	|			ТОГДА ТаблицаПоказанияПриборовУчета.Разница
	|		ИНАЧЕ ТаблицаПоказанияПриборовУчета.ТекущиеПоказания
	|	КОНЕЦ КАК Показание,
	|	ТаблицаПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВложенныйЗапрос.ИсточникПоказаний = ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.КонтрольныйСъем) КАК КС,
	|	ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний,
	|	ТаблицаПоказанияПриборовУчета.Переворот КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ТаблицаШкалы.IDСтроки КАК IDСтроки,
	|		ТаблицаШкалы.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Шапка.Дата КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.ИсточникПоказаний КАК ИсточникПоказаний,
	|			ТаблицаТочки.КлючПомещения КАК КлючПомещения,
	|			ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|			ТаблицаТочки.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			Шапка.ПериодНачисления КАК ПериодНачисления,
	|			ТаблицаТочки.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргОбходнойЛист КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист.ТочкиУчета КАК ТаблицаТочки
	|				ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (ТаблицаТочки.Ссылка В (&мДокументы))
	|					И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист.ШкалыПриборовУчета КАК ТаблицаШкалы
	|			ПО ВложенныйЗапрос.Регистратор = ТаблицаШкалы.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалы.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки
	|			И (ВЫБОР
	|				КОГДА ТаблицаПоказанияПриборовУчета.СтатусИзмененПользователем
	|						ИЛИ ТаблицаПоказанияПриборовУчета.ПереворотИзмененПользователем
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ НЕ ТаблицаПоказанияПриборовУчета.ПричинаОтклонения В (&ПричиныОтклоненияИсключая)
	|			КОНЕЦ)
	|			И (ТаблицаПоказанияПриборовУчета.ПоказанияПредоставлены)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
